[
  {
    "word": "Indefinite Article A1",
    "phonetic": "/ə/",
    "banglaPronunciation": "একটি",
    "meaning": "একটি",
    "examples": "PRESENT IND: A cat is sitting on the mat, PAST IND: A dog barked outside yesterday, FUTURE IND: There will be a meeting next week."
  },
  {
    "word": "Abandon v. B2",
    "phonetic": "/əˈbændən/",
    "banglaPronunciation": "অবহেলা করা",
    "meaning": "পরিত্যাগ করা",
    "examples": "PRESENT IND: They abandon their old habits easily, PAST IND: He abandoned his car after it broke down on the highway, FUTURE IND: She will abandon her current project if it doesn’t work out."
  },
  {
    "word": "Ability N. A2",
    "phonetic": "/əˈbɪlɪti/",
    "banglaPronunciation": "ক্ষমতা",
    "meaning": "সম্পন্ন করার ক্ষমতা",
    "examples": "PRESENT IND: He has the ability to solve complex problems, PAST IND: She had the ability to sing beautifully when she was younger, FUTURE IND: They will develop their ability to communicate effectively through practice."
  },
  {
    "word": "Able Adj, A2",
    "phonetic": "/ˈeɪbl/",
    "banglaPronunciation": "সক্ষম",
    "meaning": "সম্পন্ন করার ক্ষমতা আছে",
    "examples": "PRESENT IND: She is able to complete the task on time, PAST IND: I was able to finish the report before the deadline, FUTURE IND: They will be able to join us for dinner tomorrow."
  },
  {
    "word": "About Prep, Adv. A1",
    "phonetic": "/əˈbaʊt/",
    "banglaPronunciation": "সম্পর্কিত",
    "meaning": "সম্পর্কে",
    "examples": "PRESENT IND: I’m thinking about his problem, PAST IND: He thought about his options before deciding, FUTURE IND: She will be thinking about her next steps."
  },
  {
    "word": "Above Prep, Adv. A1",
    "phonetic": "/əˈbʌv/",
    "banglaPronunciation": "উপরে",
    "meaning": "উপরে",
    "examples": "PRESENT IND: The airplane flies above the clouds, PAST IND: The bird flew above the trees yesterday, FUTURE IND: We will look above for any signs of trouble."
  },
  {
    "word": "Abroad Adv. A2",
    "phonetic": "/əˈbrɔːd/",
    "banglaPronunciation": "বিদেশে",
    "meaning": "বিদেশে",
    "examples": "PRESENT IND: She often travels abroad for work, PAST IND: He studied abroad last year, FUTURE IND: They will move abroad next month."
  },
  {
    "word": "Absolute Adj, B2",
    "phonetic": "/ˈæbsəluːt/",
    "banglaPronunciation": "নির্ঘণ্ট",
    "meaning": "নির্দিষ্ট",
    "examples": "PRESENT IND: The results are absolute and cannot be disputed, PAST IND: His victory was absolute in the last election, FUTURE IND: They will seek absolute clarity on the issue."
  },
  {
    "word": "Absolutely A dv. B1",
    "phonetic": "/ˈæb.sə.luːt.li/",
    "banglaPronunciation": "পরম",
    "meaning": "সম্পূর্ণভাবে",
    "examples": "PRESENT IND: She absolutely loves her new job, PAST IND: He was absolutely certain about his decision yesterday, FUTURE IND: They will absolutely support the new policy."
  },
  {
    "word": "Academic Adj. B1, N. B2",
    "phonetic": "/ˌæk.əˈdem.ɪk/",
    "banglaPronunciation": "শিক্ষাগত",
    "meaning": "শিক্ষা সম্পর্কিত",
    "examples": "PRESENT IND: He is an academic who teaches history, PAST IND: She was an academic at the university last year, FUTURE IND: They will become academics in their field."
  },
  {
    "word": "Accept V.82",
    "phonetic": "/əkˈsept/",
    "banglaPronunciation": "গ্রহণ করা",
    "meaning": "গ্রহণ করা",
    "examples": "PRESENT IND: She accepts the offer gladly, PAST IND: He accepted the award yesterday, FUTURE IND: They will accept the challenge next week."
  },
  {
    "word": "Access N. V.81",
    "phonetic": "/ˈæk.ses/",
    "banglaPronunciation": "প্রবেশাধিকার",
    "meaning": "প্রবেশের অধিকার",
    "examples": "PRESENT IND: He has access to the database, PAST IND: She accessed the files yesterday, FUTURE IND: They will access the system tomorrow."
  },
  {
    "word": "Accident N. V.81",
    "phonetic": "/ˈæk.sɪ.dənt/",
    "banglaPronunciation": "দুর্ঘটনা",
    "meaning": "অপ্রত্যাশিত দুর্ঘটনা",
    "examples": "PRESENT IND: A car accident occurs daily, PAST IND: An accident happened on the highway yesterday, FUTURE IND: There will be an accident if they drive carelessly."
  },
  {
    "word": "Accompany V.82",
    "phonetic": "/əˈkʌm.pə.ni/",
    "banglaPronunciation": "সঙ্গী হওয়া",
    "meaning": "সঙ্গে যাওয়া",
    "examples": "PRESENT IND: She accompanies him to school, PAST IND: He accompanied her to the event yesterday, FUTURE IND: They will accompany us on the trip."
  },
  {
    "word": "According To Prep.A2",
    "phonetic": "/əˈkɔːr.dɪŋ/",
    "banglaPronunciation": "অনুযায়ী",
    "meaning": "অনুসারে",
    "examples": "PRESENT IND: According to the news, it will rain today, PAST IND: According to him, it rained yesterday, FUTURE IND: According to the forecast, it will snow tomorrow."
  },
  {
    "word": "Accurate Adj. B2",
    "phonetic": "/ˈæk.jə.rət/",
    "banglaPronunciation": "ঠিক",
    "meaning": "সঠিক",
    "examples": "PRESENT IND: His calculations are accurate, PAST IND: Her prediction was accurate last week, FUTURE IND: They will ensure the data is accurate."
  },
  {
    "word": "Accuse V. B2",
    "phonetic": "/əˈkjuːz/",
    "banglaPronunciation": "অভিযোগ করা",
    "meaning": "to say that someone has done something wrong",
    "examples": "PRESENT IND: They accuse him of cheating. PAST IND: She accused him of theft last year. FUTURE IND: The prosecutor will accuse the suspect in court."
  },
  {
    "word": "Achieve V. A2",
    "phonetic": "/əˈtʃiːv/",
    "banglaPronunciation": "সফলতা লাভ করা",
    "meaning": "to successfully complete or obtain something",
    "examples": "PRESENT IND: She will achieve her goals with hard work. PAST IND: He achieved his dreams after many years. FUTURE IND: They will achieve success together."
  },
  {
    "word": "Achievement N. B1",
    "phonetic": "/əˈtʃiːv.mənt/",
    "banglaPronunciation": "সাফল্য",
    "meaning": "something successfully done",
    "examples": "PRESENT IND: Winning the award is a significant achievement. PAST IND: Her graduation was a major achievement for her family. FUTURE IND: They will celebrate their achievement next week."
  },
  {
    "word": "Acknowledge e V. B2",
    "phonetic": "/əkˈnɒl.ɪdʒ/",
    "banglaPronunciation": "স্বীকার করা",
    "meaning": "to accept or admit the existence or truth of",
    "examples": "PRESENT IND: We must acknowledge his contributions. PAST IND: They acknowledged her efforts in the meeting. FUTURE IND: She will acknowledge the support she received."
  },
  {
    "word": "Acquire V. B2",
    "phonetic": "/əˈkwaɪər/",
    "banglaPronunciation": "অর্জন করা",
    "meaning": "to gain possession or control of something",
    "examples": "PRESENT IND: They acquire new skills through practice. PAST IND: He acquired a taste for fine wines after traveling in Europe. FUTURE IND: She will acquire additional knowledge by attending workshops."
  },
  {
    "word": "Across Prep., Adv. A1",
    "phonetic": "/əˈkrɒs/",
    "banglaPronunciation": "অতিক্রমণ",
    "meaning": "from one side to the other of something",
    "examples": "PRESENT IND: She travels across the country for work. PAST IND: They walked across the bridge yesterday. FUTURE IND: He will run across the field tomorrow."
  },
  {
    "word": "Act V. A2, N. B1",
    "phonetic": "/ækt/",
    "banglaPronunciation": "অভিনয় করা",
    "meaning": "to perform in a play or movie",
    "examples": "PRESENT IND: I will act in the school play. PAST IND: They acted well during the performance. FUTURE IND: She will act on her instincts."
  },
  {
    "word": "Action N. A1",
    "phonetic": "/ˈæk.ʃən/",
    "banglaPronunciation": "কর্ম",
    "meaning": "the process of doing something",
    "examples": "PRESENT IND: The action takes place in the city. PAST IND: The action was thrilling to watch. FUTURE IND: They will plan their next action carefully."
  },
  {
    "word": "Active Adj. A2",
    "phonetic": "/ˈæk.tɪv/",
    "banglaPronunciation": "সক্রিয়",
    "meaning": "doing things and involving a lot of movement",
    "examples": "PRESENT IND: She remains active in the community. PAST IND: He was active in sports during college. FUTURE IND: They will stay active through regular exercise."
  },
  {
    "word": "Activity N. A1",
    "phonetic": "/ækˈtɪv.ɪ.ti/",
    "banglaPronunciation": "কার্যকলাপ",
    "meaning": "a thing that you do for interest or pleasure",
    "examples": "PRESENT IND: Physical activity is important for health. PAST IND: The school organized a fun activity last week. FUTURE IND: There will be an exciting activity planned for the weekend."
  },
  {
    "word": "Actor N. A1",
    "phonetic": "/ˈæk.tər/",
    "banglaPronunciation": "অভিনেতা",
    "meaning": "a person who performs in plays or movies",
    "examples": "PRESENT IND: He is a talented actor. PAST IND: She always wanted to be an actor."
  }
]
